Booome/stm32-ov7670-live/Core/Src/bsp/st7735.c
/**
  * @file    st7735.c
  * @brief   ST7735 1.8" TFT LCD driver implementation
  */
#include "st7735.h"
#include "dwt_delay.h"
#include "stm32f1xx_hal.h"

/* SPI2 handle (defined in main.c) */
extern SPI_HandleTypeDef hspi2;

/* ST7735 command set */
#define ST7735_CMD_SLPOUT   0x11u
#define ST7735_CMD_MADCTL   0x36u
#define ST7735_CMD_COLMOD   0x3Au
#define ST7735_CMD_INVON    0x21u
#define ST7735_CMD_NORON    0x13u
#define ST7735_CMD_DISPON   0x29u
#define ST7735_CMD_CASET    0x2Au
#define ST7735_CMD_RASET    0x2Bu
#define ST7735_CMD_RAMWR    0x2Cu

/*
 * MADCTL: D5=MV (landscape), D3=BGR
 *
 * Default 0x28 = MV=1 + BGR=1 (common for 1.8" ST7735 modules).
 * If image is upside down: toggle D7 (MY) -> 0xA8.
 * If red/blue swapped: toggle D3 (RGB) -> 0x20.
 */
#define ST7735_MADCTL_VAL   0x28u

#define ST7735_COLMOD_RGB565  0x05u

/**
  * @brief   Send command byte via SPI (DC=0)
  * @param   cmd  Command byte
  *
  *          Caller manages CS. DC is set low before transmit.
  */
static void WriteCmd(uint8_t cmd)
{
  LCD_DC_Low();
  HAL_SPI_Transmit(&hspi2, &cmd, 1u, HAL_MAX_DELAY);
}

/**
  * @brief   Send data bytes via SPI (DC=1)
  * @param   data  Pointer to data buffer
  * @param   len   Number of bytes to send
  *
  *          Caller manages CS. DC is set high before transmit.
  */
static void WriteData(const uint8_t *data, uint16_t len)
{
  LCD_DC_High();
  HAL_SPI_Transmit(&hspi2, data, len, HAL_MAX_DELAY);
}

void LCD_Init(void)
{
  /* Backlight on */
  LCD_BL_On();

  /* Hardware reset: low >= 10us, then high */
  LCD_RESET_Low();
  DWT_DelayUs(10u);
  LCD_RESET_High();
  DWT_DelayMs(120u);

  /* CS low for entire init sequence */
  LCD_CS_Low();

  WriteCmd(ST7735_CMD_SLPOUT);
  DWT_DelayMs(120u);

  uint8_t madctl = ST7735_MADCTL_VAL;
  WriteCmd(ST7735_CMD_MADCTL);
  WriteData(&madctl, 1u);

  uint8_t colmod = ST7735_COLMOD_RGB565;
  WriteCmd(ST7735_CMD_COLMOD);
  WriteData(&colmod, 1u);

  WriteCmd(ST7735_CMD_INVON);
  WriteCmd(ST7735_CMD_NORON);
  WriteCmd(ST7735_CMD_DISPON);

  /* CS high after init */
  LCD_CS_High();
}

void LCD_SetAddrWindow(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{
  uint8_t caset[4] =
  {
    (uint8_t)(x0 >> 8),
    (uint8_t)(x0 & 0xFFu),
    (uint8_t)(x1 >> 8),
    (uint8_t)(x1 & 0xFFu)
  };
  uint8_t raset[4] =
  {
    (uint8_t)(y0 >> 8),
    (uint8_t)(y0 & 0xFFu),
    (uint8_t)(y1 >> 8),
    (uint8_t)(y1 & 0xFFu)
  };

  /* CS low for entire address window + RAMWR sequence */
  LCD_CS_Low();

  WriteCmd(ST7735_CMD_CASET);
  WriteData(caset, 4u);

  WriteCmd(ST7735_CMD_RASET);
  WriteData(raset, 4u);

  WriteCmd(ST7735_CMD_RAMWR);

  /* DC=1 for pixel data, CS stays low for SPI DMA stream */
  LCD_DC_High();
}
